---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SplitSketchBasedElementFailures
source: html/b8b86da8-f81b-9e66-6520-85d3d3bc6d1b.htm
---
# BuiltInFailures.SplitSketchBasedElementFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.